results/test2_10pods_30k_5050_32kb/fio-benchmark-0.log
Starting FIO benchmark on pod 0...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
size=10G
runtime=600
ramp_time=60
time_based=1
group_reporting=1
directory=/mnt/fio-data

iodepth=32
iodepth_batch_submit=32
iodepth_batch_complete_min=1
iodepth_batch_complete_max=32

refill_buffers=0
scramble_buffers=0
randrepeat=0
norandommap=1
cpus_allowed_policy=split

[test2-30k-32k-write-1]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-1]
rw=randread
bs=32k
rate_iops=3750

[test2-30k-32k-write-2]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-2]
rw=randread
bs=32k
rate_iops=3750

[test2-30k-32k-write-3]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-3]
rw=randread
bs=32k
rate_iops=3750

[test2-30k-32k-write-4]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-4]
rw=randread
bs=32k
rate_iops=3750
---
test2-30k-32k-write-1: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-write-2: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-2: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-write-3: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-3: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-write-4: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-4: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
fio-3.41
Starting 8 processes
test2-30k-32k-write-1: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-1: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-write-2: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-2: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-write-3: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-3: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-write-4: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-4: Laying out IO file (1 file / 10240MiB)

test2-30k-32k-write-1: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 08:10:25 2026
  read: IOPS=15.0k, BW=469MiB/s (492MB/s)(275GiB/600001msec)
    slat (usec): min=3, max=1055, avg=52.97, stdev=42.67
    clat (nsec): min=1845, max=36823k, avg=1107187.69, stdev=810771.58
     lat (usec): min=191, max=36859, avg=1160.16, stdev=824.36
    clat percentiles (usec):
     |  1.00th=[  343],  5.00th=[  437], 10.00th=[  502], 20.00th=[  603],
     | 30.00th=[  693], 40.00th=[  783], 50.00th=[  881], 60.00th=[ 1004],
     | 70.00th=[ 1188], 80.00th=[ 1500], 90.00th=[ 1942], 95.00th=[ 2343],
     | 99.00th=[ 4228], 99.50th=[ 5669], 99.90th=[ 8717], 99.95th=[ 9503],
     | 99.99th=[12780]
   bw (  KiB/s): min=438720, max=512256, per=100.00%, avg=480048.58, stdev=620.46, samples=4800
   iops        : min=13710, max=16008, avg=15001.41, stdev=19.39, samples=4800
  write: IOPS=15.0k, BW=469MiB/s (492MB/s)(275GiB/600002msec); 0 zone resets
    slat (usec): min=3, max=1783, avg=62.04, stdev=46.99
    clat (usec): min=51, max=37152, avg=1261.35, stdev=840.15
     lat (usec): min=311, max=37215, avg=1323.39, stdev=855.93
    clat percentiles (usec):
     |  1.00th=[  474],  5.00th=[  578], 10.00th=[  644], 20.00th=[  734],
     | 30.00th=[  816], 40.00th=[  906], 50.00th=[ 1004], 60.00th=[ 1139],
     | 70.00th=[ 1369], 80.00th=[ 1696], 90.00th=[ 2114], 95.00th=[ 2540],
     | 99.00th=[ 4555], 99.50th=[ 5932], 99.90th=[ 8979], 99.95th=[ 9765],
     | 99.99th=[13173]
   bw (  KiB/s): min=440832, max=511552, per=100.00%, avg=480050.41, stdev=628.86, samples=4800
   iops        : min=13776, max=15986, avg=15001.47, stdev=19.65, samples=4800
  lat (usec)   : 2=0.01%, 4=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=0.02%, 500=5.74%, 750=23.41%, 1000=25.43%
  lat (msec)   : 2=34.81%, 4=9.34%, 10=1.20%, 20=0.03%, 50=0.01%
  cpu          : usr=1.10%, sys=3.68%, ctx=19350512, majf=0, minf=3659
  IO depths    : 1=0.0%, 2=0.6%, 4=42.0%, 8=53.1%, 16=3.0%, 32=1.3%, >=64=0.0%
     submit    : 0=0.0%, 4=48.2%, 8=39.8%, 16=11.7%, 32=0.3%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.1%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=8999987,8999993,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=469MiB/s (492MB/s), 469MiB/s-469MiB/s (492MB/s-492MB/s), io=275GiB (295GB), run=600001-600001msec
  WRITE: bw=469MiB/s (492MB/s), 469MiB/s-469MiB/s (492MB/s-492MB/s), io=275GiB (295GB), run=600002-600002msec
FIO benchmark completed on pod 0