results/test2_10pods_30k_5050_32kb/fio-benchmark-4.log
Starting FIO benchmark on pod 4...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
size=10G
runtime=600
ramp_time=60
time_based=1
group_reporting=1
directory=/mnt/fio-data

iodepth=32
iodepth_batch_submit=32
iodepth_batch_complete_min=1
iodepth_batch_complete_max=32

refill_buffers=0
scramble_buffers=0
randrepeat=0
norandommap=1
cpus_allowed_policy=split

[test2-30k-32k-write-1]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-1]
rw=randread
bs=32k
rate_iops=3750

[test2-30k-32k-write-2]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-2]
rw=randread
bs=32k
rate_iops=3750

[test2-30k-32k-write-3]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-3]
rw=randread
bs=32k
rate_iops=3750

[test2-30k-32k-write-4]
rw=randwrite
bs=32k
rate_iops=3750

[test2-30k-32k-read-4]
rw=randread
bs=32k
rate_iops=3750
---
test2-30k-32k-write-1: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-1: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-write-2: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-2: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-write-3: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-3: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-write-4: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
test2-30k-32k-read-4: (g=0): rw=randread, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=32
fio-3.41
Starting 8 processes
test2-30k-32k-write-1: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-1: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-write-2: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-2: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-write-3: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-3: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-write-4: Laying out IO file (1 file / 10240MiB)
test2-30k-32k-read-4: Laying out IO file (1 file / 10240MiB)

test2-30k-32k-write-1: (groupid=0, jobs=8): err= 0: pid=79: Thu Sep  3 08:10:28 2026
  read: IOPS=15.0k, BW=469MiB/s (492MB/s)(275GiB/600001msec)
    slat (usec): min=3, max=1661, avg=52.80, stdev=42.68
    clat (usec): min=42, max=36785, avg=1105.26, stdev=810.57
     lat (usec): min=199, max=36824, avg=1158.06, stdev=824.40
    clat percentiles (usec):
     |  1.00th=[  334],  5.00th=[  433], 10.00th=[  498], 20.00th=[  603],
     | 30.00th=[  693], 40.00th=[  783], 50.00th=[  881], 60.00th=[ 1004],
     | 70.00th=[ 1188], 80.00th=[ 1500], 90.00th=[ 1942], 95.00th=[ 2343],
     | 99.00th=[ 4228], 99.50th=[ 5669], 99.90th=[ 8717], 99.95th=[ 9503],
     | 99.99th=[12780]
   bw (  KiB/s): min=453000, max=506816, per=100.00%, avg=480052.82, stdev=491.14, samples=4800
   iops        : min=14156, max=15838, avg=15001.54, stdev=15.35, samples=4800
  write: IOPS=15.0k, BW=469MiB/s (492MB/s)(275GiB/600001msec); 0 zone resets
    slat (usec): min=3, max=1065, avg=61.21, stdev=46.56
    clat (usec): min=47, max=36941, avg=1260.31, stdev=840.43
     lat (usec): min=285, max=37008, avg=1321.52, stdev=856.08
    clat percentiles (usec):
     |  1.00th=[  469],  5.00th=[  570], 10.00th=[  635], 20.00th=[  734],
     | 30.00th=[  816], 40.00th=[  906], 50.00th=[ 1004], 60.00th=[ 1139],
     | 70.00th=[ 1369], 80.00th=[ 1696], 90.00th=[ 2114], 95.00th=[ 2540],
     | 99.00th=[ 4555], 99.50th=[ 5932], 99.90th=[ 8979], 99.95th=[ 9765],
     | 99.99th=[13304]
   bw (  KiB/s): min=453449, max=506048, per=100.00%, avg=480052.80, stdev=502.59, samples=4800
   iops        : min=14170, max=15814, avg=15001.53, stdev=15.70, samples=4800
  lat (usec)   : 50=0.01%, 100=0.01%, 250=0.03%, 500=5.96%, 750=23.33%
  lat (usec)   : 1000=25.34%
  lat (msec)   : 2=34.76%, 4=9.35%, 10=1.20%, 20=0.03%, 50=0.01%
  cpu          : usr=1.04%, sys=3.66%, ctx=19376931, majf=0, minf=2259
  IO depths    : 1=0.0%, 2=0.8%, 4=42.1%, 8=52.9%, 16=3.0%, 32=1.3%, >=64=0.0%
     submit    : 0=0.0%, 4=48.5%, 8=39.5%, 16=11.6%, 32=0.3%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.1%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=8999997,8999993,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=469MiB/s (492MB/s), 469MiB/s-469MiB/s (492MB/s-492MB/s), io=275GiB (295GB), run=600001-600001msec
  WRITE: bw=469MiB/s (492MB/s), 469MiB/s-469MiB/s (492MB/s-492MB/s), io=275GiB (295GB), run=600001-600001msec
FIO benchmark completed on pod 4